SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_i2c.h
/***********************************************************************************************************************
    @file     reg_i2c.h
    @author   VV TEAM
    @brief    This flie contains all the I2C's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_I2C_H
#define __REG_I2C_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief I2C Base Address Definition
  */
#define  I2C1_BASE                                 0x40005400                                       /*!<Base Address: 0x40005400*/
#define  I2C2_BASE                                 0x40005800                                       /*!<Base Address: 0x40005800*/

/**
  * @brief I2C Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                             /*!<I2C Control Register                           offset: 0x00       */
    __IO uint32_t TAR;                            /*!<I2C Target Address Register                    offset: 0x04       */
    __IO uint32_t SAR;                            /*!<I2C Slave Address Register                     offset: 0x08       */
    __IO uint32_t RESERVED0x0C[1];                /*!<                                               offset: 0x0C       */
    __IO uint32_t DR;                             /*!<I2C Data Command Register                      offset: 0x10       */
    __IO uint32_t SSHR;                           /*!<I2C Standard Mode SCL High Count Register      offset: 0x14       */
    __IO uint32_t SSLR;                           /*!<I2C Standard Mode SCL Low Count Register       offset: 0x18       */
    __IO uint32_t FSHR;                           /*!<I2C Fast/Super fast Mode SCL High Count        offset: 0x1C
                                                      Register                                                          */
    __IO uint32_t FSLR;                           /*!<I2C Fast/Super fast Mode SCL Low Count         offset: 0x20
                                                      Register                                                          */
    __IO uint32_t RESERVED0x24[2];                /*!<                                               offset: 0x24~0x28  */
    __IO uint32_t ISR;                            /*!<I2C Interrupt Status Register                  offset: 0x2C       */
    __IO uint32_t IMR;                            /*!<I2C Interrupt Mask Register                    offset: 0x30       */
    __IO uint32_t RAWISR;                         /*!<I2C RAW Interrupt Status Register              offset: 0x34       */
    __IO uint32_t RXTLR;                          /*!<I2C Receive Threshold Register                 offset: 0x38       */
    __IO uint32_t TXTLR;                          /*!<I2C Transmit Threshold Register                offset: 0x3C       */
    __IO uint32_t ICR;                            /*!<I2C Combined and Independent Interrupt Clear   offset: 0x40
                                                      Register                                                          */
    __IO uint32_t RX_UNDER;                       /*!<I2C RX_UNDER Interrupt Clear Register          offset: 0x44       */
    __IO uint32_t RX_OVER;                        /*!<I2C RX_OVER Interrupt Clear Register           offset: 0x48       */
    __IO uint32_t TX_OVER;                        /*!<I2C TX_OVER Interrupt Clear Register           offset: 0x4C       */
    __IO uint32_t RD_REQ;                         /*!<I2C RD_REQ Interrupt Clear Register            offset: 0x50       */
    __IO uint32_t TX_ABRT;                        /*!<I2C TX_ABRT Interrupt Clear Register           offset: 0x54       */
    __IO uint32_t RX_DONE;                        /*!<I2C RX_DONE Interrupt Clear Register           offset: 0x58       */
    __IO uint32_t ACTIV;                          /*!<I2C ACTIVITY Interrupt Clear Register          offset: 0x5C       */
    __IO uint32_t STOP;                           /*!<I2C STOP_DET Interrupt Clear Register          offset: 0x60       */
    __IO uint32_t START;                          /*!<I2C START_DET Interrupt Clear Register         offset: 0x64       */
    __IO uint32_t GC;                             /*!<I2C GEN_CALL Interrupt Clear Register          offset: 0x68       */
    __IO uint32_t ENR;                            /*!<I2C Enable Register                            offset: 0x6C       */
    __IO uint32_t SR;                             /*!<I2C Status Register                            offset: 0x70       */
    __IO uint32_t TXFLR;                          /*!<I2C Transmit FIFO Level Register               offset: 0x74       */
    __IO uint32_t RXFLR;                          /*!<I2C Receive FIFO Level Register                offset: 0x78       */
    __IO uint32_t HOLD;                           /*!<I2C SDA Hold Time Register                     offset: 0x7C       */
    __IO uint32_t TX_ABRT_SRC;                    /*!<                                               offset: 0x80       */
    __IO uint32_t SLV_NACK;                       /*!<                                               offset: 0x84       */
    __IO uint32_t DMA;                            /*!<I2C DMA Control Register                       offset: 0x88       */
    __IO uint32_t RESERVED0x8C[2];                /*!<                                               offset: 0x8C~0x90  */
    __IO uint32_t SETUP;                          /*!<I2C SDA Setup Time Register                    offset: 0x94       */
    __IO uint32_t GCR;                            /*!<I2C General Call ACK Register                  offset: 0x98       */
    __IO uint32_t EN_SR;                          /*!<                                               offset: 0x9C       */
    __IO uint32_t SPKLEN;                         /*!<                                               offset: 0xA0       */
    __IO uint32_t RESERVED0xA4[2];                /*!<                                               offset: 0xA4~0xA8  */
    __IO uint32_t SCL_TMO;                        /*!<                                               offset: 0xAC       */
    __IO uint32_t SDA_TMO;                        /*!<                                               offset: 0xB0       */
    __IO uint32_t SCL_STUCK;                      /*!<                                               offset: 0xB4       */
    __IO uint32_t RESERVED0xB8[1];                /*!<                                               offset: 0xB8       */
    __IO uint32_t SMB_SEXT;                       /*!<                                               offset: 0xBC       */
    __IO uint32_t SMB_MEXT;                       /*!<                                               offset: 0xC0       */
    __IO uint32_t SMB_IDLE;                       /*!<                                               offset: 0xC4       */
    __IO uint32_t SMB_ISR;                        /*!<                                               offset: 0xC8       */
    __IO uint32_t SMB_IMR;                        /*!<                                               offset: 0xCC       */
    __IO uint32_t SMB_RAWISR;                     /*!<                                               offset: 0xD0       */
    __IO uint32_t SMB_ICR;                        /*!<                                               offset: 0xD4       */
    __IO uint32_t OPT_SAR;                        /*!<                                               offset: 0xD8       */
    __IO uint32_t SMB_UDID_LSB;                   /*!<                                               offset: 0xDC       */
    __IO uint32_t SMB_UDID_MSB0;                  /*!<                                               offset: 0xE0       */
    __IO uint32_t SMB_UDID_MSB1;                  /*!<                                               offset: 0xE4       */
    __IO uint32_t SMB_UDID_MSB2;                  /*!<                                               offset: 0xE8       */
    __IO uint32_t SLVMASK;                        /*!<                                               offset: 0xEC       */
    __IO uint32_t SLVRCVADDR;                     /*!<                                               offset: 0xF0       */
} I2C_TypeDef;

/**
  * @brief I2C type pointer Definition
  */
#define I2C1                                      ((I2C_TypeDef *)I2C1_BASE)
#define I2C2                                      ((I2C_TypeDef *)I2C2_BASE)

/**
  * @brief I2C_CR Register Bit Definition
  */
#define  I2C_CR_MASTER_Pos                        (0)
#define  I2C_CR_MASTER_Msk                        (0x1U << I2C_CR_MASTER_Pos)                       /*!<This bit controls whether the I2C master is enabled.*/
#define  I2C_CR_MASTER                            I2C_CR_MASTER_Msk
#define  I2C_CR_SPEED_Pos                         (1)
#define  I2C_CR_SPEED_Msk                         (0x3U << I2C_CR_SPEED_Pos)                        /*!<These bits control at which speed the I2C operates in the Master mode.*/
#define  I2C_CR_SPEED                             I2C_CR_SPEED_Msk
#define  I2C_CR_SPEED_Bit0                        (0x1U << I2C_CR_SPEED_Pos) 
#define  I2C_CR_SPEED_Bit1                        (0x2U << I2C_CR_SPEED_Pos) 
#define  I2C_CR_SLAVE10_Pos                       (3)
#define  I2C_CR_SLAVE10_Msk                       (0x1U << I2C_CR_SLAVE10_Pos)                      /*!<When I2C is acting as a slave, this bit controls whether it responds to 7- or 10-bit addresses.*/
#define  I2C_CR_SLAVE10                           I2C_CR_SLAVE10_Msk
#define  I2C_CR_MASTER10_Pos                      (4)
#define  I2C_CR_MASTER10_Msk                      (0x1U << I2C_CR_MASTER10_Pos)                     /*!<Addressing mode when I2C is acting as a master*/
#define  I2C_CR_MASTER10                          I2C_CR_MASTER10_Msk
#define  I2C_CR_REPEN_Pos                         (5)
#define  I2C_CR_REPEN_Msk                         (0x1U << I2C_CR_REPEN_Pos)                        /*!<This bit determines whether RESTART conditions may be sent when I2C is acting as a master.*/
#define  I2C_CR_REPEN                             I2C_CR_REPEN_Msk
#define  I2C_CR_DISSLAVE_Pos                      (6)
#define  I2C_CR_DISSLAVE_Msk                      (0x1U << I2C_CR_DISSLAVE_Pos)                     /*!<This bit controls whether I2C has its slave disabled*/
#define  I2C_CR_DISSLAVE                          I2C_CR_DISSLAVE_Msk
#define  I2C_CR_STOPINT_Pos                       (7)
#define  I2C_CR_STOPINT_Msk                       (0x1U << I2C_CR_STOPINT_Pos)                      /*!<This bit controls whether a STOP interrupt is generated in the Slave mode.*/
#define  I2C_CR_STOPINT                           I2C_CR_STOPINT_Msk
#define  I2C_CR_EMPINT_Pos                        (8)
#define  I2C_CR_EMPINT_Msk                        (0x1U << I2C_CR_EMPINT_Pos)                       /*!<This bit controls whether a TX_EMPTY interrupt is generated. For details, refer to the I2C_RAWISR register.*/
#define  I2C_CR_EMPINT                            I2C_CR_EMPINT_Msk
#define  I2C_CR_STOP_Pos                          (9)
#define  I2C_CR_STOP_Msk                          (0x1U << I2C_CR_STOP_Pos)                         /*!<This bit controls whether a STOP is issued after transmission or reception.*/
#define  I2C_CR_STOP                              I2C_CR_STOP_Msk
#define  I2C_CR_RESTART_Pos                       (10)
#define  I2C_CR_RESTART_Msk                       (0x1U << I2C_CR_RESTART_Pos)                      /*!<This bit controls whether a RESTART is issued before transmission or reception.*/
#define  I2C_CR_RESTART                           I2C_CR_RESTART_Msk
#define  I2C_CR_SLV_TX_ABRT_DIS_Pos               (11)
#define  I2C_CR_SLV_TX_ABRT_DIS_Msk               (0x1U << I2C_CR_SLV_TX_ABRT_DIS_Pos)              /*!<When I2C is acting as a slave-transmitter*/
#define  I2C_CR_SLV_TX_ABRT_DIS                   I2C_CR_SLV_TX_ABRT_DIS_Msk
#define  I2C_CR_PAD_SEL_Pos                       (12)
#define  I2C_CR_PAD_SEL_Msk                       (0x1U << I2C_CR_PAD_SEL_Pos)                      /*!<PAD MUX Exchange the corresponding PADs of SCL and SDA*/
#define  I2C_CR_PAD_SEL                           I2C_CR_PAD_SEL_Msk
#define  I2C_CR_OPT_SAR_EN_Pos                    (16)
#define  I2C_CR_OPT_SAR_EN_Msk                    (0x1U << I2C_CR_OPT_SAR_EN_Pos)                   /*!<0: Disable the usage of OPT_SAR register*/
#define  I2C_CR_OPT_SAR_EN                        I2C_CR_OPT_SAR_EN_Msk
#define  I2C_CR_SMB_SLV_QC_EN_Pos                 (17)
#define  I2C_CR_SMB_SLV_QC_EN_Msk                 (0x1U << I2C_CR_SMB_SLV_QC_EN_Pos)                /*!<0: I2C slave slave receives all bus protocols but not Quick commands*/
#define  I2C_CR_SMB_SLV_QC_EN                     I2C_CR_SMB_SLV_QC_EN_Msk
#define  I2C_CR_SMB_ARP_EN_Pos                    (18)
#define  I2C_CR_SMB_ARP_EN_Msk                    (0x1U << I2C_CR_SMB_ARP_EN_Pos)                   /*!<0: Address resolution logic disable in SMBus mode*/
#define  I2C_CR_SMB_ARP_EN                        I2C_CR_SMB_ARP_EN_Msk
#define  I2C_CR_SMB_PSA_EN_Pos                    (19)
#define  I2C_CR_SMB_PSA_EN_Msk                    (0x1U << I2C_CR_SMB_PSA_EN_Pos)                   /*!<0: enable I2C as non-persistent slave device; I2C slave device clears the address valid flag bit for General/Directed Reset ARP command*/
#define  I2C_CR_SMB_PSA_EN                        I2C_CR_SMB_PSA_EN_Msk
#define  I2C_CR_STOP_DET_MST_ACT_Pos              (20)
#define  I2C_CR_STOP_DET_MST_ACT_Msk              (0x1U << I2C_CR_STOP_DET_MST_ACT_Pos)             /*!<In master mode,*/
#define  I2C_CR_STOP_DET_MST_ACT                  I2C_CR_STOP_DET_MST_ACT_Msk
#define  I2C_CR_BUS_CLR_Pos                       (21)
#define  I2C_CR_BUS_CLR_Msk                       (0x1U << I2C_CR_BUS_CLR_Pos)                      /*!<0: Bus Clear is disabled*/
#define  I2C_CR_BUS_CLR                           I2C_CR_BUS_CLR_Msk
#define  I2C_CR_RX_FULL_HLD_Pos                   (22)
#define  I2C_CR_RX_FULL_HLD_Msk                   (0x1U << I2C_CR_RX_FULL_HLD_Pos)                  /*!<0: I2C does not hold the bus when RX FIFO is physically full to its depth*/
#define  I2C_CR_RX_FULL_HLD                       I2C_CR_RX_FULL_HLD_Msk

/**
  * @brief I2C_TAR Register Bit Definition
  */
#define  I2C_TAR_ADDR_Pos                         (0)
#define  I2C_TAR_ADDR_Msk                         (0x3FFU << I2C_TAR_ADDR_Pos)                      /*!<This is the target address for any master transaction.*/
#define  I2C_TAR_ADDR                             I2C_TAR_ADDR_Msk
#define  I2C_TAR_ADDR_Bit0                        (0x001U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit1                        (0x002U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit2                        (0x004U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit3                        (0x008U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit4                        (0x010U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit5                        (0x020U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit6                        (0x040U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit7                        (0x080U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit8                        (0x100U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_ADDR_Bit9                        (0x200U << I2C_TAR_ADDR_Pos) 
#define  I2C_TAR_GC_Pos                           (10)
#define  I2C_TAR_GC_Msk                           (0x1U << I2C_TAR_GC_Pos)                          /*!<If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a General Call or START byte command is to be performed by the I2C.*/
#define  I2C_TAR_GC                               I2C_TAR_GC_Msk
#define  I2C_TAR_SPECIAL_Pos                      (11)
#define  I2C_TAR_SPECIAL_Msk                      (0x1U << I2C_TAR_SPECIAL_Pos)                     /*!<This bit indicates whether software performs a General Call or Start Byte command.*/
#define  I2C_TAR_SPECIAL                          I2C_TAR_SPECIAL_Msk
#define  I2C_TAR_SMB_QC_Pos                       (16)
#define  I2C_TAR_SMB_QC_Msk                       (0x1U << I2C_TAR_SMB_QC_Pos)                      /*!<If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a Quick command is to be performed by the I2C*/
#define  I2C_TAR_SMB_QC                           I2C_TAR_SMB_QC_Msk

/**
  * @brief I2C_SAR Register Bit Definition
  */
#define  I2C_SAR_ADDR_Pos                         (0)
#define  I2C_SAR_ADDR_Msk                         (0x3FFU << I2C_SAR_ADDR_Pos)                      /*!<The slave address of I2C. For 7-bit addressing, only ADDR [6:0] is valid.*/
#define  I2C_SAR_ADDR                             I2C_SAR_ADDR_Msk
#define  I2C_SAR_ADDR_Bit0                        (0x001U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit1                        (0x002U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit2                        (0x004U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit3                        (0x008U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit4                        (0x010U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit5                        (0x020U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit6                        (0x040U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit7                        (0x080U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit8                        (0x100U << I2C_SAR_ADDR_Pos) 
#define  I2C_SAR_ADDR_Bit9                        (0x200U << I2C_SAR_ADDR_Pos) 

/**
  * @brief I2C_DR Register Bit Definition
  */
#define  I2C_DR_DAT_Pos                           (0)
#define  I2C_DR_DAT_Msk                           (0xFFU << I2C_DR_DAT_Pos)                         /*!<This register contains the data to be transmitted or received on the I2C bus.*/
#define  I2C_DR_DAT                               I2C_DR_DAT_Msk
#define  I2C_DR_DAT_Bit0                          (0x01U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit1                          (0x02U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit2                          (0x04U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit3                          (0x08U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit4                          (0x10U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit5                          (0x20U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit6                          (0x40U << I2C_DR_DAT_Pos) 
#define  I2C_DR_DAT_Bit7                          (0x80U << I2C_DR_DAT_Pos) 
#define  I2C_DR_CMD_Pos                           (8)
#define  I2C_DR_CMD_Msk                           (0x1U << I2C_DR_CMD_Pos)                          /*!<This bit controls whether a read or a write is performed in the Master mode.*/
#define  I2C_DR_CMD                               I2C_DR_CMD_Msk
#define  I2C_DR_FIRST_DATA_Pos                    (11)
#define  I2C_DR_FIRST_DATA_Msk                    (0x1U << I2C_DR_FIRST_DATA_Pos)                   /*!<Indicates the first data byte received after the address phase for receive transfer in Master receiver or Slave receiver mode.*/
#define  I2C_DR_FIRST_DATA                        I2C_DR_FIRST_DATA_Msk

/**
  * @brief I2C_SSHR Register Bit Definition
  */
#define  I2C_SSHR_CNT_Pos                         (0)
#define  I2C_SSHR_CNT_Msk                         (0xFFFFU << I2C_SSHR_CNT_Pos)                     /*!<This register sets the SCL clock high-period count (min valid value is 6) for Standard mode.*/
#define  I2C_SSHR_CNT                             I2C_SSHR_CNT_Msk
#define  I2C_SSHR_CNT_Bit0                        (0x0001U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit1                        (0x0002U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit2                        (0x0004U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit3                        (0x0008U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit4                        (0x0010U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit5                        (0x0020U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit6                        (0x0040U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit7                        (0x0080U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit8                        (0x0100U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit9                        (0x0200U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit10                       (0x0400U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit11                       (0x0800U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit12                       (0x1000U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit13                       (0x2000U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit14                       (0x4000U << I2C_SSHR_CNT_Pos) 
#define  I2C_SSHR_CNT_Bit15                       (0x8000U << I2C_SSHR_CNT_Pos) 

