SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_i2c.h
/**
  * @brief I2C_SSLR Register Bit Definition
  */
#define  I2C_SSLR_CNT_Pos                         (0)
#define  I2C_SSLR_CNT_Msk                         (0xFFFFU << I2C_SSLR_CNT_Pos)                     /*!<This register sets the SCL clock low-period count (min valid value is 6) for Standard mode.*/
#define  I2C_SSLR_CNT                             I2C_SSLR_CNT_Msk
#define  I2C_SSLR_CNT_Bit0                        (0x0001U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit1                        (0x0002U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit2                        (0x0004U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit3                        (0x0008U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit4                        (0x0010U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit5                        (0x0020U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit6                        (0x0040U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit7                        (0x0080U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit8                        (0x0100U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit9                        (0x0200U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit10                       (0x0400U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit11                       (0x0800U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit12                       (0x1000U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit13                       (0x2000U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit14                       (0x4000U << I2C_SSLR_CNT_Pos) 
#define  I2C_SSLR_CNT_Bit15                       (0x8000U << I2C_SSLR_CNT_Pos) 

/**
  * @brief I2C_FSHR Register Bit Definition
  */
#define  I2C_FSHR_CNT_Pos                         (0)
#define  I2C_FSHR_CNT_Msk                         (0xFFFFU << I2C_FSHR_CNT_Pos)                     /*!<This register sets the SCL clock high-period count (min valid value is 1) for Fast mode/ Fast mode Plus.*/
#define  I2C_FSHR_CNT                             I2C_FSHR_CNT_Msk
#define  I2C_FSHR_CNT_Bit0                        (0x0001U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit1                        (0x0002U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit2                        (0x0004U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit3                        (0x0008U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit4                        (0x0010U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit5                        (0x0020U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit6                        (0x0040U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit7                        (0x0080U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit8                        (0x0100U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit9                        (0x0200U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit10                       (0x0400U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit11                       (0x0800U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit12                       (0x1000U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit13                       (0x2000U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit14                       (0x4000U << I2C_FSHR_CNT_Pos) 
#define  I2C_FSHR_CNT_Bit15                       (0x8000U << I2C_FSHR_CNT_Pos) 

/**
  * @brief I2C_FSLR Register Bit Definition
  */
#define  I2C_FSLR_CNT_Pos                         (0)
#define  I2C_FSLR_CNT_Msk                         (0xFFFFU << I2C_FSLR_CNT_Pos)                     /*!<This register sets the SCL clock low-period count (min valid value is 6) for Fast mode/ Fast mode Plus.*/
#define  I2C_FSLR_CNT                             I2C_FSLR_CNT_Msk
#define  I2C_FSLR_CNT_Bit0                        (0x0001U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit1                        (0x0002U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit2                        (0x0004U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit3                        (0x0008U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit4                        (0x0010U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit5                        (0x0020U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit6                        (0x0040U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit7                        (0x0080U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit8                        (0x0100U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit9                        (0x0200U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit10                       (0x0400U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit11                       (0x0800U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit12                       (0x1000U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit13                       (0x2000U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit14                       (0x4000U << I2C_FSLR_CNT_Pos) 
#define  I2C_FSLR_CNT_Bit15                       (0x8000U << I2C_FSLR_CNT_Pos) 

/**
  * @brief I2C_ISR Register Bit Definition
  */
#define  I2C_ISR_R_RX_UNDER_Pos                   (0)
#define  I2C_ISR_R_RX_UNDER_Msk                   (0x1U << I2C_ISR_R_RX_UNDER_Pos)                  /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_RX_UNDER                       I2C_ISR_R_RX_UNDER_Msk
#define  I2C_ISR_R_RX_OVER_Pos                    (1)
#define  I2C_ISR_R_RX_OVER_Msk                    (0x1U << I2C_ISR_R_RX_OVER_Pos)                   /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_RX_OVER                        I2C_ISR_R_RX_OVER_Msk
#define  I2C_ISR_R_RX_FULL_Pos                    (2)
#define  I2C_ISR_R_RX_FULL_Msk                    (0x1U << I2C_ISR_R_RX_FULL_Pos)                   /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_RX_FULL                        I2C_ISR_R_RX_FULL_Msk
#define  I2C_ISR_R_TX_OVER_Pos                    (3)
#define  I2C_ISR_R_TX_OVER_Msk                    (0x1U << I2C_ISR_R_TX_OVER_Pos)                   /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_TX_OVER                        I2C_ISR_R_TX_OVER_Msk
#define  I2C_ISR_R_TX_EMPTY_Pos                   (4)
#define  I2C_ISR_R_TX_EMPTY_Msk                   (0x1U << I2C_ISR_R_TX_EMPTY_Pos)                  /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_TX_EMPTY                       I2C_ISR_R_TX_EMPTY_Msk
#define  I2C_ISR_R_RD_REQ_Pos                     (5)
#define  I2C_ISR_R_RD_REQ_Msk                     (0x1U << I2C_ISR_R_RD_REQ_Pos)                    /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_RD_REQ                         I2C_ISR_R_RD_REQ_Msk
#define  I2C_ISR_R_TX_ABRT_Pos                    (6)
#define  I2C_ISR_R_TX_ABRT_Msk                    (0x1U << I2C_ISR_R_TX_ABRT_Pos)                   /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_TX_ABRT                        I2C_ISR_R_TX_ABRT_Msk
#define  I2C_ISR_R_RX_DONE_Pos                    (7)
#define  I2C_ISR_R_RX_DONE_Msk                    (0x1U << I2C_ISR_R_RX_DONE_Pos)                   /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_RX_DONE                        I2C_ISR_R_RX_DONE_Msk
#define  I2C_ISR_R_ACTIV_Pos                      (8)
#define  I2C_ISR_R_ACTIV_Msk                      (0x1U << I2C_ISR_R_ACTIV_Pos)                     /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_ACTIV                          I2C_ISR_R_ACTIV_Msk
#define  I2C_ISR_R_STOP_Pos                       (9)
#define  I2C_ISR_R_STOP_Msk                       (0x1U << I2C_ISR_R_STOP_Pos)                      /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_STOP                           I2C_ISR_R_STOP_Msk
#define  I2C_ISR_R_START_Pos                      (10)
#define  I2C_ISR_R_START_Msk                      (0x1U << I2C_ISR_R_START_Pos)                     /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_START                          I2C_ISR_R_START_Msk
#define  I2C_ISR_R_GC_Pos                         (11)
#define  I2C_ISR_R_GC_Msk                         (0x1U << I2C_ISR_R_GC_Pos)                        /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_GC                             I2C_ISR_R_GC_Msk
#define  I2C_ISR_R_MST_ON_HOLD_Pos                (13)
#define  I2C_ISR_R_MST_ON_HOLD_Msk                (0x1U << I2C_ISR_R_MST_ON_HOLD_Pos)               /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_MST_ON_HOLD                    I2C_ISR_R_MST_ON_HOLD_Msk
#define  I2C_ISR_R_SCL_STUCK_AT_LOW_Pos           (14)
#define  I2C_ISR_R_SCL_STUCK_AT_LOW_Msk           (0x1U << I2C_ISR_R_SCL_STUCK_AT_LOW_Pos)          /*!<Refer to I2C_RAWISR register for more details*/
#define  I2C_ISR_R_SCL_STUCK_AT_LOW               I2C_ISR_R_SCL_STUCK_AT_LOW_Msk

/**
  * @brief I2C_IMR Register Bit Definition
  */
#define  I2C_IMR_M_RX_UNDER_Pos                   (0)
#define  I2C_IMR_M_RX_UNDER_Msk                   (0x1U << I2C_IMR_M_RX_UNDER_Pos)                  /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_RX_UNDER                       I2C_IMR_M_RX_UNDER_Msk
#define  I2C_IMR_M_RX_OVER_Pos                    (1)
#define  I2C_IMR_M_RX_OVER_Msk                    (0x1U << I2C_IMR_M_RX_OVER_Pos)                   /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_RX_OVER                        I2C_IMR_M_RX_OVER_Msk
#define  I2C_IMR_M_RX_FULL_Pos                    (2)
#define  I2C_IMR_M_RX_FULL_Msk                    (0x1U << I2C_IMR_M_RX_FULL_Pos)                   /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_RX_FULL                        I2C_IMR_M_RX_FULL_Msk
#define  I2C_IMR_M_TX_OVER_Pos                    (3)
#define  I2C_IMR_M_TX_OVER_Msk                    (0x1U << I2C_IMR_M_TX_OVER_Pos)                   /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_TX_OVER                        I2C_IMR_M_TX_OVER_Msk
#define  I2C_IMR_M_TX_EMPTY_Pos                   (4)
#define  I2C_IMR_M_TX_EMPTY_Msk                   (0x1U << I2C_IMR_M_TX_EMPTY_Pos)                  /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_TX_EMPTY                       I2C_IMR_M_TX_EMPTY_Msk
#define  I2C_IMR_M_RD_REQ_Pos                     (5)
#define  I2C_IMR_M_RD_REQ_Msk                     (0x1U << I2C_IMR_M_RD_REQ_Pos)                    /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_RD_REQ                         I2C_IMR_M_RD_REQ_Msk
#define  I2C_IMR_M_TX_ABRT_Pos                    (6)
#define  I2C_IMR_M_TX_ABRT_Msk                    (0x1U << I2C_IMR_M_TX_ABRT_Pos)                   /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_TX_ABRT                        I2C_IMR_M_TX_ABRT_Msk
#define  I2C_IMR_M_RX_DONE_Pos                    (7)
#define  I2C_IMR_M_RX_DONE_Msk                    (0x1U << I2C_IMR_M_RX_DONE_Pos)                   /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_RX_DONE                        I2C_IMR_M_RX_DONE_Msk
#define  I2C_IMR_M_ACTIV_Pos                      (8)
#define  I2C_IMR_M_ACTIV_Msk                      (0x1U << I2C_IMR_M_ACTIV_Pos)                     /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_ACTIV                          I2C_IMR_M_ACTIV_Msk
#define  I2C_IMR_M_STOP_Pos                       (9)
#define  I2C_IMR_M_STOP_Msk                       (0x1U << I2C_IMR_M_STOP_Pos)                      /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_STOP                           I2C_IMR_M_STOP_Msk
#define  I2C_IMR_M_START_Pos                      (10)
#define  I2C_IMR_M_START_Msk                      (0x1U << I2C_IMR_M_START_Pos)                     /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_START                          I2C_IMR_M_START_Msk
#define  I2C_IMR_M_GC_Pos                         (11)
#define  I2C_IMR_M_GC_Msk                         (0x1U << I2C_IMR_M_GC_Pos)                        /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_GC                             I2C_IMR_M_GC_Msk
#define  I2C_IMR_M_MST_ON_HOLD_Pos                (13)
#define  I2C_IMR_M_MST_ON_HOLD_Msk                (0x1U << I2C_IMR_M_MST_ON_HOLD_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_MST_ON_HOLD                    I2C_IMR_M_MST_ON_HOLD_Msk
#define  I2C_IMR_M_SCL_STUCK_Pos                  (14)
#define  I2C_IMR_M_SCL_STUCK_Msk                  (0x1U << I2C_IMR_M_SCL_STUCK_Pos)                 /*!<Mask the interrupt status bit corresponding to I2C_ISR register*/
#define  I2C_IMR_M_SCL_STUCK                      I2C_IMR_M_SCL_STUCK_Msk

/**
  * @brief I2C_RAWISR Register Bit Definition
  */
#define  I2C_RAWISR_RX_UNDER_Pos                  (0)
#define  I2C_RAWISR_RX_UNDER_Msk                  (0x1U << I2C_RAWISR_RX_UNDER_Pos)                 /*!<Receive buffer over Set if the processor attempts to read the I2C_DR register when RX FIFO is empty.*/
#define  I2C_RAWISR_RX_UNDER                      I2C_RAWISR_RX_UNDER_Msk
#define  I2C_RAWISR_RX_OVER_Pos                   (1)
#define  I2C_RAWISR_RX_OVER_Msk                   (0x1U << I2C_RAWISR_RX_OVER_Pos)                  /*!<Receive buffer over Set if the receive buffer is full and an additional byte is received. The I2C interface acknowledges this, but new data will be lost. Note: RX_OVER interrupt cannot occur when RX_FULL_HLD = 1.*/
#define  I2C_RAWISR_RX_OVER                       I2C_RAWISR_RX_OVER_Msk
#define  I2C_RAWISR_RX_FULL_Pos                   (2)
#define  I2C_RAWISR_RX_FULL_Msk                   (0x1U << I2C_RAWISR_RX_FULL_Pos)                  /*!<Receive buffer full Set when the receive buffer is above the threshold. It is cleared by hardware when the receive buffer level is at or below the threshold.*/
#define  I2C_RAWISR_RX_FULL                       I2C_RAWISR_RX_FULL_Msk
#define  I2C_RAWISR_TX_OVER_Pos                   (3)
#define  I2C_RAWISR_TX_OVER_Msk                   (0x1U << I2C_RAWISR_TX_OVER_Pos)                  /*!<Transmit buffer over When the transmit buffer is full, the processor writes new data and causes overflow, which sets the bit to 1.*/
#define  I2C_RAWISR_TX_OVER                       I2C_RAWISR_TX_OVER_Msk
#define  I2C_RAWISR_TX_EMPTY_Pos                  (4)
#define  I2C_RAWISR_TX_EMPTY_Msk                  (0x1U << I2C_RAWISR_TX_EMPTY_Pos)                 /*!<Transmit buffer empty*/
#define  I2C_RAWISR_TX_EMPTY                      I2C_RAWISR_TX_EMPTY_Msk
#define  I2C_RAWISR_RD_REQ_Pos                    (5)
#define  I2C_RAWISR_RD_REQ_Msk                    (0x1U << I2C_RAWISR_RD_REQ_Pos)                   /*!<Read request*/
#define  I2C_RAWISR_RD_REQ                        I2C_RAWISR_RD_REQ_Msk
#define  I2C_RAWISR_TX_ABRT_Pos                   (6)
#define  I2C_RAWISR_TX_ABRT_Msk                   (0x1U << I2C_RAWISR_TX_ABRT_Pos)                  /*!<Transmit abort*/
#define  I2C_RAWISR_TX_ABRT                       I2C_RAWISR_TX_ABRT_Msk
#define  I2C_RAWISR_RX_DONE_Pos                   (7)
#define  I2C_RAWISR_RX_DONE_Msk                   (0x1U << I2C_RAWISR_RX_DONE_Pos)                  /*!<Slave transmit done When the I2C is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done.*/
#define  I2C_RAWISR_RX_DONE                       I2C_RAWISR_RX_DONE_Msk
#define  I2C_RAWISR_ACTIV_Pos                     (8)
#define  I2C_RAWISR_ACTIV_Msk                     (0x1U << I2C_RAWISR_ACTIV_Pos)                    /*!<This bit captures I2C module activity. Once this bit is set, it stays set unless one of the four methods is used to clear it: Disabling the I2C Reading the I2C_ACTIV register Reading the I2C_ICR register System reset Even if the I2C is idle, this bit remains set until cleared.*/
#define  I2C_RAWISR_ACTIV                         I2C_RAWISR_ACTIV_Msk
#define  I2C_RAWISR_STOP_Pos                      (9)
#define  I2C_RAWISR_STOP_Msk                      (0x1U << I2C_RAWISR_STOP_Pos)                     /*!<STOP condition detection The status of this bit differs based on the status of I2C_CR.STOPINT (bit 7): STOPINT = 0*/
#define  I2C_RAWISR_STOP                          I2C_RAWISR_STOP_Msk
#define  I2C_RAWISR_START_Pos                     (10)
#define  I2C_RAWISR_START_Msk                     (0x1U << I2C_RAWISR_START_Pos)                    /*!<START condition detection This bit is set to 1 once a START or RESTART condition has occurred on the I2C interface regardless of whether I2C is operating in Master or Slave mode.*/
#define  I2C_RAWISR_START                         I2C_RAWISR_START_Msk
#define  I2C_RAWISR_GC_Pos                        (11)
#define  I2C_RAWISR_GC_Msk                        (0x1U << I2C_RAWISR_GC_Pos)                       /*!<General Call Set when a General Call address is received and acknowledged. It is cleared either by disabling I2C or when the CPU reads the I2C_GC.GC (bit 0). I2C stores the received data in the Rx buffer.*/
#define  I2C_RAWISR_GC                            I2C_RAWISR_GC_Msk
#define  I2C_RAWISR_MST_ON_HOLD_Pos               (13)
#define  I2C_RAWISR_MST_ON_HOLD_Msk               (0x1U << I2C_RAWISR_MST_ON_HOLD_Pos)              /*!<Indicates whether a master is holding the bus and the TX FIFO is empty.*/
#define  I2C_RAWISR_MST_ON_HOLD                   I2C_RAWISR_MST_ON_HOLD_Msk
#define  I2C_RAWISR_SCL_STUCK_Pos                 (14)
#define  I2C_RAWISR_SCL_STUCK_Msk                 (0x1U << I2C_RAWISR_SCL_STUCK_Pos)                /*!<Indicates whether the SCL Line is stuck at low for the I2C_SCL_TMO number of APB clock periods.*/
#define  I2C_RAWISR_SCL_STUCK                     I2C_RAWISR_SCL_STUCK_Msk

/**
  * @brief I2C_RXTLR Register Bit Definition
  */
#define  I2C_RXTLR_TL_Pos                         (0)
#define  I2C_RXTLR_TL_Msk                         (0x3U << I2C_RXTLR_TL_Pos)                        /*!<Receive FIFO threshold level*/
#define  I2C_RXTLR_TL                             I2C_RXTLR_TL_Msk
#define  I2C_RXTLR_TL_Bit0                        (0x1U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_Bit1                        (0x2U << I2C_RXTLR_TL_Pos) 

/**
  * @brief I2C_TXTLR Register Bit Definition
  */
#define  I2C_TXTLR_TL_Pos                         (0)
#define  I2C_TXTLR_TL_Msk                         (0x3U << I2C_TXTLR_TL_Pos)                        /*!<Transmit FIFO threshold level*/
#define  I2C_TXTLR_TL                             I2C_TXTLR_TL_Msk
#define  I2C_TXTLR_TL_Bit0                        (0x1U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_Bit1                        (0x2U << I2C_TXTLR_TL_Pos) 

/**
  * @brief I2C_ICR Register Bit Definition
  */
#define  I2C_ICR_ICR_Pos                          (0)
#define  I2C_ICR_ICR_Msk                          (0x1U << I2C_ICR_ICR_Pos)                         /*!<Reading this register clears all combined and independent interrupts. This bit only clears software clearable interrupts, instead of hardware clearable interrupts*/
#define  I2C_ICR_ICR                              I2C_ICR_ICR_Msk

/**
  * @brief I2C_RX_UNDER Register Bit Definition
  */
#define  I2C_RX_UNDER_RX_UNDER_Pos                (0)
#define  I2C_RX_UNDER_RX_UNDER_Msk                (0x1U << I2C_RX_UNDER_RX_UNDER_Pos)               /*!<Reading this register clears the RX_UNDER interrupt (I2C_RAWISR[0]).*/
#define  I2C_RX_UNDER_RX_UNDER                    I2C_RX_UNDER_RX_UNDER_Msk

/**
  * @brief I2C_RX_OVER Register Bit Definition
  */
#define  I2C_RX_OVER_RX_OVER_Pos                  (0)
#define  I2C_RX_OVER_RX_OVER_Msk                  (0x1U << I2C_RX_OVER_RX_OVER_Pos)                 /*!<Reading this register clears the RX_OVER interrupt (I2C_RAWISR[1]).*/
#define  I2C_RX_OVER_RX_OVER                      I2C_RX_OVER_RX_OVER_Msk

/**
  * @brief I2C_TX_OVER Register Bit Definition
  */
#define  I2C_TX_OVER_TX_OVER_Pos                  (0)
#define  I2C_TX_OVER_TX_OVER_Msk                  (0x1U << I2C_TX_OVER_TX_OVER_Pos)                 /*!<Reading this register clears the TX_OVER interrupt (I2C_RAWISR[3]).*/
#define  I2C_TX_OVER_TX_OVER                      I2C_TX_OVER_TX_OVER_Msk

/**
  * @brief I2C_RD_REQ Register Bit Definition
  */
#define  I2C_RD_REQ_RD_REQ_Pos                    (0)
#define  I2C_RD_REQ_RD_REQ_Msk                    (0x1U << I2C_RD_REQ_RD_REQ_Pos)                   /*!<Reading this register clears the RD_REQ interrupt (I2C_RAWISR[5]).*/
#define  I2C_RD_REQ_RD_REQ                        I2C_RD_REQ_RD_REQ_Msk

/**
  * @brief I2C_TX_ABRT Register Bit Definition
  */
#define  I2C_TX_ABRT_TX_ABRT_Pos                  (0)
#define  I2C_TX_ABRT_TX_ABRT_Msk                  (0x1U << I2C_TX_ABRT_TX_ABRT_Pos)                 /*!<Reading this register clears the TX_ABRT interrupt (I2C_RAWISR[6]). This also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO.*/
#define  I2C_TX_ABRT_TX_ABRT                      I2C_TX_ABRT_TX_ABRT_Msk

/**
  * @brief I2C_RX_DONE Register Bit Definition
  */
#define  I2C_RX_DONE_RX_DONE_Pos                  (0)
#define  I2C_RX_DONE_RX_DONE_Msk                  (0x1U << I2C_RX_DONE_RX_DONE_Pos)                 /*!<Reading this register clears the RX_DONE interrupt (I2C_RAWISR[7]).*/
#define  I2C_RX_DONE_RX_DONE                      I2C_RX_DONE_RX_DONE_Msk

/**
  * @brief I2C_ACTIV Register Bit Definition
  */
#define  I2C_ACTIV_ACTIV_Pos                      (0)
#define  I2C_ACTIV_ACTIV_Msk                      (0x1U << I2C_ACTIV_ACTIV_Pos)                     /*!<Reading this register clears the ACTIV interrupt (I2C_RAWISR[8]) if the I2C is not active anymore.*/
#define  I2C_ACTIV_ACTIV                          I2C_ACTIV_ACTIV_Msk

/**
  * @brief I2C_STOP Register Bit Definition
  */
#define  I2C_STOP_STOP_Pos                        (0)
#define  I2C_STOP_STOP_Msk                        (0x1U << I2C_STOP_STOP_Pos)                       /*!<Reading this register clears the STOP interrupt (I2C_RAWISR[9]).*/
#define  I2C_STOP_STOP                            I2C_STOP_STOP_Msk

/**
  * @brief I2C_START Register Bit Definition
  */
#define  I2C_START_START_Pos                      (0)
#define  I2C_START_START_Msk                      (0x1U << I2C_START_START_Pos)                     /*!<Reading this register clears the START interrupt (I2C_RAWISR[10]).*/
#define  I2C_START_START                          I2C_START_START_Msk

/**
  * @brief I2C_GC Register Bit Definition
  */
#define  I2C_GC_GC_Pos                            (0)
#define  I2C_GC_GC_Msk                            (0x1U << I2C_GC_GC_Pos)                           /*!<Reading this register clears the GC interrupt (I2C_RAWISR[11]).*/
#define  I2C_GC_GC                                I2C_GC_GC_Msk

