SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_i2c.h
/**
  * @brief I2C_ENR Register Bit Definition
  */
#define  I2C_ENR_ENABLE_Pos                       (0)
#define  I2C_ENR_ENABLE_Msk                       (0x1U << I2C_ENR_ENABLE_Pos)                      /*!<I2C module enable*/
#define  I2C_ENR_ENABLE                           I2C_ENR_ENABLE_Msk
#define  I2C_ENR_ABORT_Pos                        (1)
#define  I2C_ENR_ABORT_Msk                        (0x1U << I2C_ENR_ABORT_Pos)                       /*!<I2C transfer abort*/
#define  I2C_ENR_ABORT                            I2C_ENR_ABORT_Msk
#define  I2C_ENR_TX_CMD_BLOCK_Pos                 (2)
#define  I2C_ENR_TX_CMD_BLOCK_Msk                 (0x1U << I2C_ENR_TX_CMD_BLOCK_Pos)                /*!<In master mode,*/
#define  I2C_ENR_TX_CMD_BLOCK                     I2C_ENR_TX_CMD_BLOCK_Msk
#define  I2C_ENR_SDA_RCV_EN_Pos                   (3)
#define  I2C_ENR_SDA_RCV_EN_Msk                   (0x1U << I2C_ENR_SDA_RCV_EN_Pos)                  /*!<If SDA is stuck at low indicated through the TX_ABORT interrupt, then this bit is used as a control knob to initiate the SDA Recovery Mechanism (that is, send at most 9 SCL clocks and STOP to release the SDA line) and then this bit gets auto clear.*/
#define  I2C_ENR_SDA_RCV_EN                       I2C_ENR_SDA_RCV_EN_Msk
#define  I2C_ENR_SMB_CLK_RST_Pos                  (16)
#define  I2C_ENR_SMB_CLK_RST_Msk                  (0x1U << I2C_ENR_SMB_CLK_RST_Pos)                 /*!<This bit is used in SMBus Host mode to initiate the SMBus Master Clock Reset. Whenever this bit is enabled, SMBCLK is held low for I2C_SCL_TMO.SCL_TIMEOUT APB cycles to reset the slave device.*/
#define  I2C_ENR_SMB_CLK_RST                      I2C_ENR_SMB_CLK_RST_Msk
#define  I2C_ENR_SMB_ALT_EN_Pos                   (18)
#define  I2C_ENR_SMB_ALT_EN_Msk                   (0x1U << I2C_ENR_SMB_ALT_EN_Pos)                  /*!<SMBus Alert Enable*/
#define  I2C_ENR_SMB_ALT_EN                       I2C_ENR_SMB_ALT_EN_Msk

/**
  * @brief I2C_SR Register Bit Definition
  */
#define  I2C_SR_ACTIV_Pos                         (0)
#define  I2C_SR_ACTIV_Msk                         (0x1U << I2C_SR_ACTIV_Pos)                        /*!<I2C activity status*/
#define  I2C_SR_ACTIV                             I2C_SR_ACTIV_Msk
#define  I2C_SR_TFNF_Pos                          (1)
#define  I2C_SR_TFNF_Msk                          (0x1U << I2C_SR_TFNF_Pos)                         /*!<Transmit FIFO not full*/
#define  I2C_SR_TFNF                              I2C_SR_TFNF_Msk
#define  I2C_SR_TFE_Pos                           (2)
#define  I2C_SR_TFE_Msk                           (0x1U << I2C_SR_TFE_Pos)                          /*!<Transmit FIFO completely empty*/
#define  I2C_SR_TFE                               I2C_SR_TFE_Msk
#define  I2C_SR_RFNE_Pos                          (3)
#define  I2C_SR_RFNE_Msk                          (0x1U << I2C_SR_RFNE_Pos)                         /*!<Receive FIFO not empty*/
#define  I2C_SR_RFNE                              I2C_SR_RFNE_Msk
#define  I2C_SR_RFF_Pos                           (4)
#define  I2C_SR_RFF_Msk                           (0x1U << I2C_SR_RFF_Pos)                          /*!<Receive FIFO completely full*/
#define  I2C_SR_RFF                               I2C_SR_RFF_Msk
#define  I2C_SR_MST_ACTIV_Pos                     (5)
#define  I2C_SR_MST_ACTIV_Msk                     (0x1U << I2C_SR_MST_ACTIV_Pos)                    /*!<Master FSM activity status*/
#define  I2C_SR_MST_ACTIV                         I2C_SR_MST_ACTIV_Msk
#define  I2C_SR_SLV_ACTIV_Pos                     (6)
#define  I2C_SR_SLV_ACTIV_Msk                     (0x1U << I2C_SR_SLV_ACTIV_Pos)                    /*!<Slave FSM activity status*/
#define  I2C_SR_SLV_ACTIV                         I2C_SR_SLV_ACTIV_Msk
#define  I2C_SR_MST_HOLD_TX_EMPTY_Pos             (7)
#define  I2C_SR_MST_HOLD_TX_EMPTY_Msk             (0x1U << I2C_SR_MST_HOLD_TX_EMPTY_Pos)            /*!<This bit indicates the BUS hold when the master holds the bus because of the TX FIFO being empty*/
#define  I2C_SR_MST_HOLD_TX_EMPTY                 I2C_SR_MST_HOLD_TX_EMPTY_Msk
#define  I2C_SR_MST_HOLD_RX_FULL_Pos              (8)
#define  I2C_SR_MST_HOLD_RX_FULL_Msk              (0x1U << I2C_SR_MST_HOLD_RX_FULL_Pos)             /*!<This bit indicates the BUS Hold in Master mode due to RX FIFO is Full and additional byte has been received*/
#define  I2C_SR_MST_HOLD_RX_FULL                  I2C_SR_MST_HOLD_RX_FULL_Msk
#define  I2C_SR_SLV_HOLD_TX_EMPTY_Pos             (9)
#define  I2C_SR_SLV_HOLD_TX_EMPTY_Msk             (0x1U << I2C_SR_SLV_HOLD_TX_EMPTY_Pos)            /*!<This bit indicates the BUS Hold in Slave mode for the Read request when the TX FIFO is empty. The Bus is in hold until the TX FIFO has data to Transmit for the read request.*/
#define  I2C_SR_SLV_HOLD_TX_EMPTY                 I2C_SR_SLV_HOLD_TX_EMPTY_Msk
#define  I2C_SR_SLV_HOLD_RX_FULL_Pos              (10)
#define  I2C_SR_SLV_HOLD_RX_FULL_Msk              (0x1U << I2C_SR_SLV_HOLD_RX_FULL_Pos)             /*!<This bit indicates the BUS Hold in Slave mode due to the RX FIFO being Full and an additional byte being received*/
#define  I2C_SR_SLV_HOLD_RX_FULL                  I2C_SR_SLV_HOLD_RX_FULL_Msk
#define  I2C_SR_SDA_NOT_RECOVERED_Pos             (11)
#define  I2C_SR_SDA_NOT_RECOVERED_Msk             (0x1U << I2C_SR_SDA_NOT_RECOVERED_Pos)            /*!<This bit indicates that an SDA stuck at low is not recovered after the recovery mechanism.*/
#define  I2C_SR_SDA_NOT_RECOVERED                 I2C_SR_SDA_NOT_RECOVERED_Msk
#define  I2C_SR_SMB_QC_Pos                        (16)
#define  I2C_SR_SMB_QC_Msk                        (0x1U << I2C_SR_SMB_QC_Pos)                       /*!<SMBus Quick command status bit*/
#define  I2C_SR_SMB_QC                            I2C_SR_SMB_QC_Msk
#define  I2C_SR_SMB_SLV_AV_Pos                    (17)
#define  I2C_SR_SMB_SLV_AV_Msk                    (0x1U << I2C_SR_SMB_SLV_AV_Pos)                   /*!<SMBus Slave Address Valid Status Bit*/
#define  I2C_SR_SMB_SLV_AV                        I2C_SR_SMB_SLV_AV_Msk
#define  I2C_SR_SMB_SLV_AR_Pos                    (18)
#define  I2C_SR_SMB_SLV_AR_Msk                    (0x1U << I2C_SR_SMB_SLV_AR_Pos)                   /*!<SMBus Slave Address Resolved status bits*/
#define  I2C_SR_SMB_SLV_AR                        I2C_SR_SMB_SLV_AR_Msk
#define  I2C_SR_SMB_ALT_Pos                       (20)
#define  I2C_SR_SMB_ALT_Msk                       (0x1U << I2C_SR_SMB_ALT_Pos)                      /*!<SMBus alert status bit*/
#define  I2C_SR_SMB_ALT                           I2C_SR_SMB_ALT_Msk

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define  I2C_TXFLR_CNT_Pos                        (0)
#define  I2C_TXFLR_CNT_Msk                        (0x7U << I2C_TXFLR_CNT_Pos)                       /*!<Contains the number of valid data entries in the transmit FIFO (0~4)*/
#define  I2C_TXFLR_CNT                            I2C_TXFLR_CNT_Msk
#define  I2C_TXFLR_CNT_Bit0                       (0x1U << I2C_TXFLR_CNT_Pos) 
#define  I2C_TXFLR_CNT_Bit1                       (0x2U << I2C_TXFLR_CNT_Pos) 
#define  I2C_TXFLR_CNT_Bit2                       (0x4U << I2C_TXFLR_CNT_Pos) 

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define  I2C_RXFLR_CNT_Pos                        (0)
#define  I2C_RXFLR_CNT_Msk                        (0x7U << I2C_RXFLR_CNT_Pos)                       /*!<Contains the number of valid data entries in the receive FIFO (0~4)*/
#define  I2C_RXFLR_CNT                            I2C_RXFLR_CNT_Msk
#define  I2C_RXFLR_CNT_Bit0                       (0x1U << I2C_RXFLR_CNT_Pos) 
#define  I2C_RXFLR_CNT_Bit1                       (0x2U << I2C_RXFLR_CNT_Pos) 
#define  I2C_RXFLR_CNT_Bit2                       (0x4U << I2C_RXFLR_CNT_Pos) 

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define  I2C_HOLD_TX_HOLD_Pos                     (0)
#define  I2C_HOLD_TX_HOLD_Msk                     (0xFFFFU << I2C_HOLD_TX_HOLD_Pos)                 /*!<Sets the SDA hold time (after SCL goes from high to low ) in units of APB clock period, when I2C device acts as a transmitter.*/
#define  I2C_HOLD_TX_HOLD                         I2C_HOLD_TX_HOLD_Msk
#define  I2C_HOLD_TX_HOLD_Bit0                    (0x0001U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit1                    (0x0002U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit2                    (0x0004U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit3                    (0x0008U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit4                    (0x0010U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit5                    (0x0020U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit6                    (0x0040U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit7                    (0x0080U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit8                    (0x0100U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit9                    (0x0200U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit10                   (0x0400U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit11                   (0x0800U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit12                   (0x1000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit13                   (0x2000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit14                   (0x4000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_Bit15                   (0x8000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Pos                     (16)
#define  I2C_HOLD_RX_HOLD_Msk                     (0xFFU << I2C_HOLD_RX_HOLD_Pos)                   /*!<Sets the internal SDA hold time (valid while SCL is high) in units of APB clock period, when I2C device acts as a receiver.*/
#define  I2C_HOLD_RX_HOLD                         I2C_HOLD_RX_HOLD_Msk
#define  I2C_HOLD_RX_HOLD_Bit0                    (0x01U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit1                    (0x02U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit2                    (0x04U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit3                    (0x08U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit4                    (0x10U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit5                    (0x20U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit6                    (0x40U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Bit7                    (0x80U << I2C_HOLD_RX_HOLD_Pos) 

/**
  * @brief I2C_TX_ABRT_SRC Register Bit Definition
  */
#define  I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos          (0)
#define  I2C_TX_ABRT_SRC_7ADDR_NOACK_Msk          (0x1U << I2C_TX_ABRT_SRC_7ADDR_NOACK_Pos)         /*!<Set when the master device operates in 7-bit addressing mode and no slave device responds to the address*/
#define  I2C_TX_ABRT_SRC_7ADDR_NOACK              I2C_TX_ABRT_SRC_7ADDR_NOACK_Msk
#define  I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos        (1)
#define  I2C_TX_ABRT_SRC_10ADDR1_NOACK_Msk        (0x1U << I2C_TX_ABRT_SRC_10ADDR1_NOACK_Pos)       /*!<Set when the master device operates in 10-bit addressing mode and no slave device responds to the first address byte*/
#define  I2C_TX_ABRT_SRC_10ADDR1_NOACK            I2C_TX_ABRT_SRC_10ADDR1_NOACK_Msk
#define  I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos        (2)
#define  I2C_TX_ABRT_SRC_10ADDR2_NOACK_Msk        (0x1U << I2C_TX_ABRT_SRC_10ADDR2_NOACK_Pos)       /*!<Set when the master device operates in 10-bit addressing mode and no slave device responds to the second address byte*/
#define  I2C_TX_ABRT_SRC_10ADDR2_NOACK            I2C_TX_ABRT_SRC_10ADDR2_NOACK_Msk
#define  I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos         (3)
#define  I2C_TX_ABRT_SRC_TXDATA_NOACK_Msk         (0x1U << I2C_TX_ABRT_SRC_TXDATA_NOACK_Pos)        /*!<Set when the master device receives an address response and no slave device responds to the data sent*/
#define  I2C_TX_ABRT_SRC_TXDATA_NOACK             I2C_TX_ABRT_SRC_TXDATA_NOACK_Msk
#define  I2C_TX_ABRT_SRC_GC_NOACK_Pos             (4)
#define  I2C_TX_ABRT_SRC_GC_NOACK_Msk             (0x1U << I2C_TX_ABRT_SRC_GC_NOACK_Pos)            /*!<Set when no slave device responds after a general call is sent by the master device*/
#define  I2C_TX_ABRT_SRC_GC_NOACK                 I2C_TX_ABRT_SRC_GC_NOACK_Msk
#define  I2C_TX_ABRT_SRC_GC_READ_Pos              (5)
#define  I2C_TX_ABRT_SRC_GC_READ_Msk              (0x1U << I2C_TX_ABRT_SRC_GC_READ_Pos)             /*!<Set when the master device sends a general call, followed by a read request*/
#define  I2C_TX_ABRT_SRC_GC_READ                  I2C_TX_ABRT_SRC_GC_READ_Msk
#define  I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos         (7)
#define  I2C_TX_ABRT_SRC_SBYTE_ACKDET_Msk         (0x1U << I2C_TX_ABRT_SRC_SBYTE_ACKDET_Pos)        /*!<Set when the master device sends the start byte and is responded (error behavior)*/
#define  I2C_TX_ABRT_SRC_SBYTE_ACKDET             I2C_TX_ABRT_SRC_SBYTE_ACKDET_Msk
#define  I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos        (9)
#define  I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Msk        (0x1U << I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Pos)       /*!<Send the start byte when RESTART is not enabled (I2C_CR.REPEN is 0) and this bit is set*/
#define  I2C_TX_ABRT_SRC_SBYTE_NORSTRT            I2C_TX_ABRT_SRC_SBYTE_NORSTRT_Msk
#define  I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos       (10)
#define  I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Msk       (0x1U << I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Pos)      /*!<This bit is set when RESTART is not enabled (I2C_CR.REPEN is 0) and the master device sends a read request in 10-bit addressing mode*/
#define  I2C_TX_ABRT_SRC_10B_RD_NORSTRT           I2C_TX_ABRT_SRC_10B_RD_NORSTRT_Msk
#define  I2C_TX_ABRT_SRC_MST_DIS_Pos              (11)
#define  I2C_TX_ABRT_SRC_MST_DIS_Msk              (0x1U << I2C_TX_ABRT_SRC_MST_DIS_Pos)             /*!<This bit is set when the master device is operated in the disabled master mode*/
#define  I2C_TX_ABRT_SRC_MST_DIS                  I2C_TX_ABRT_SRC_MST_DIS_Msk
#define  I2C_TX_ABRT_SRC_LOST_Pos                 (12)
#define  I2C_TX_ABRT_SRC_LOST_Msk                 (0x1U << I2C_TX_ABRT_SRC_LOST_Pos)                /*!<This bit is set if the master device arbitration fails, or the slave device arbitration fails when bit 14 is set to 1*/
#define  I2C_TX_ABRT_SRC_LOST                     I2C_TX_ABRT_SRC_LOST_Msk
#define  I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Pos      (13)
#define  I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Msk      (0x1U << I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Pos)     /*!<1: Data is still in TX FIFO when the slave device receives the read request, and the slave device clears the old data in TX FIFO by generating TX_ABRT interrupt.*/
#define  I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO          I2C_TX_ABRT_SRC_SLVFLUSH_TXFIFO_Msk
#define  I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos          (14)
#define  I2C_TX_ABRT_SRC_SLV_ARBLOST_Msk          (0x1U << I2C_TX_ABRT_SRC_SLV_ARBLOST_Pos)         /*!<This bit and bit 12 are set simultaneously if the bus is lost when the slave device sends data.*/
#define  I2C_TX_ABRT_SRC_SLV_ARBLOST              I2C_TX_ABRT_SRC_SLV_ARBLOST_Msk
#define  I2C_TX_ABRT_SRC_SLVRD_INTX_Pos           (15)
#define  I2C_TX_ABRT_SRC_SLVRD_INTX_Msk           (0x1U << I2C_TX_ABRT_SRC_SLVRD_INTX_Pos)          /*!<This bit is set when I2C is requested for data from send mode to write 1 (read command) to I2C_DR.CMD (bit 8)*/
#define  I2C_TX_ABRT_SRC_SLVRD_INTX               I2C_TX_ABRT_SRC_SLVRD_INTX_Msk
#define  I2C_TX_ABRT_SRC_USER_ABRT_Pos            (16)
#define  I2C_TX_ABRT_SRC_USER_ABRT_Msk            (0x1U << I2C_TX_ABRT_SRC_USER_ABRT_Pos)           /*!<Set when transfer abort (I2C_ENR.ABORT is 1) is detected by the master device*/
#define  I2C_TX_ABRT_SRC_USER_ABRT                I2C_TX_ABRT_SRC_USER_ABRT_Msk
#define  I2C_TX_ABRT_SRC_SDA_LOW_Pos              (17)
#define  I2C_TX_ABRT_SRC_SDA_LOW_Msk              (0x1U << I2C_TX_ABRT_SRC_SDA_LOW_Pos)             /*!<This bit is set when SDA low timeout is detected by the master device*/
#define  I2C_TX_ABRT_SRC_SDA_LOW                  I2C_TX_ABRT_SRC_SDA_LOW_Msk
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos         (23)
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Msk         (0x1FFU << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos)      /*!<Number of data/commands in the TX FIFO that were flushed due to transfer interrupt*/
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT             I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Msk
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit0        (0x001U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit1        (0x002U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit2        (0x004U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit3        (0x008U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit4        (0x010U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit5        (0x020U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit6        (0x040U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit7        (0x080U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 
#define  I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Bit8        (0x100U << I2C_TX_ABRT_SRC_TX_FLUSH_CNT_Pos) 

/**
  * @brief I2C_SLV_NACK Register Bit Definition
  */
#define  I2C_SLV_NACK_NACK_Pos                    (0)
#define  I2C_SLV_NACK_NACK_Msk                    (0x1U << I2C_SLV_NACK_NACK_Pos)                   /*!<0: Generate ACK/NACK normally*/
#define  I2C_SLV_NACK_NACK                        I2C_SLV_NACK_NACK_Msk

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define  I2C_DMA_RXEN_Pos                         (0)
#define  I2C_DMA_RXEN_Msk                         (0x1U << I2C_DMA_RXEN_Pos)                        /*!<Receive DMA enable*/
#define  I2C_DMA_RXEN                             I2C_DMA_RXEN_Msk
#define  I2C_DMA_TXEN_Pos                         (1)
#define  I2C_DMA_TXEN_Msk                         (0x1U << I2C_DMA_TXEN_Pos)                        /*!<Transmit DMA enable*/
#define  I2C_DMA_TXEN                             I2C_DMA_TXEN_Msk

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define  I2C_SETUP_CNT_Pos                        (0)
#define  I2C_SETUP_CNT_Msk                        (0xFFU << I2C_SETUP_CNT_Pos)                      /*!<SDA setup time (min value is 2)*/
#define  I2C_SETUP_CNT                            I2C_SETUP_CNT_Msk
#define  I2C_SETUP_CNT_Bit0                       (0x01U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit1                       (0x02U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit2                       (0x04U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit3                       (0x08U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit4                       (0x10U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit5                       (0x20U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit6                       (0x40U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_Bit7                       (0x80U << I2C_SETUP_CNT_Pos) 

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define  I2C_GCR_GC_Pos                           (0)
#define  I2C_GCR_GC_Msk                           (0x1U << I2C_GCR_GC_Pos)                          /*!<ACK General Call*/
#define  I2C_GCR_GC                               I2C_GCR_GC_Msk

/**
  * @brief I2C_EN_SR Register Bit Definition
  */
#define  I2C_EN_SR_IC_EN_Pos                      (0)
#define  I2C_EN_SR_IC_EN_Msk                      (0x1U << I2C_EN_SR_IC_EN_Pos)                     /*!<This bit is set to 1 in the following conditions*/
#define  I2C_EN_SR_IC_EN                          I2C_EN_SR_IC_EN_Msk
#define  I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos         (1)
#define  I2C_EN_SR_SLV_DIS_WHILE_BUSY_Msk         (0x1U << I2C_EN_SR_SLV_DIS_WHILE_BUSY_Pos)        /*!<This bit indicates whether the ongoing slave mode action has been terminated by setting I2C_ENR.ENABLE from 1 to 0. (Slave Disabled While Busy)*/
#define  I2C_EN_SR_SLV_DIS_WHILE_BUSY             I2C_EN_SR_SLV_DIS_WHILE_BUSY_Msk
#define  I2C_EN_SR_SLV_RX_DATA_LOST_Pos           (2)
#define  I2C_EN_SR_SLV_RX_DATA_LOST_Msk           (0x1U << I2C_EN_SR_SLV_RX_DATA_LOST_Pos)          /*!<This bit indicates that the slave receive action (at least one data byte is received) is interrupted because I2C_ENR.ENABLE is set from 1 to 0. (Slave Received Data Lost)*/
#define  I2C_EN_SR_SLV_RX_DATA_LOST               I2C_EN_SR_SLV_RX_DATA_LOST_Msk

/**
  * @brief I2C_SPKLEN Register Bit Definition
  */
#define  I2C_SPKLEN_SPKLEN_Pos                    (0)
#define  I2C_SPKLEN_SPKLEN_Msk                    (0xFFU << I2C_SPKLEN_SPKLEN_Pos)                  /*!<Configure the Spike Suppression time, whose unit is APB clock period and minimum value is 1.*/
#define  I2C_SPKLEN_SPKLEN                        I2C_SPKLEN_SPKLEN_Msk
#define  I2C_SPKLEN_SPKLEN_Bit0                   (0x01U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit1                   (0x02U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit2                   (0x04U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit3                   (0x08U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit4                   (0x10U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit5                   (0x20U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit6                   (0x40U << I2C_SPKLEN_SPKLEN_Pos) 
#define  I2C_SPKLEN_SPKLEN_Bit7                   (0x80U << I2C_SPKLEN_SPKLEN_Pos) 

