SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_i2c.h
/**
  * @brief I2C_SCL_TMO Register Bit Definition
  */
#define  I2C_SCL_TMO_SCL_TIMEOUT_Pos              (0)
#define  I2C_SCL_TMO_SCL_TIMEOUT_Msk              (0xFFFFFFFFU << I2C_SCL_TMO_SCL_TIMEOUT_Pos)      /*!<Configure the duration of SCL low timeout whose unit is APB clock period*/
#define  I2C_SCL_TMO_SCL_TIMEOUT                  I2C_SCL_TMO_SCL_TIMEOUT_Msk
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit0             (0x00000001U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit1             (0x00000002U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit2             (0x00000004U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit3             (0x00000008U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit4             (0x00000010U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit5             (0x00000020U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit6             (0x00000040U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit7             (0x00000080U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit8             (0x00000100U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit9             (0x00000200U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit10            (0x00000400U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit11            (0x00000800U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit12            (0x00001000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit13            (0x00002000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit14            (0x00004000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit15            (0x00008000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit16            (0x00010000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit17            (0x00020000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit18            (0x00040000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit19            (0x00080000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit20            (0x00100000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit21            (0x00200000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit22            (0x00400000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit23            (0x00800000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit24            (0x01000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit25            (0x02000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit26            (0x04000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit27            (0x08000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit28            (0x10000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit29            (0x20000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit30            (0x40000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 
#define  I2C_SCL_TMO_SCL_TIMEOUT_Bit31            (0x80000000U << I2C_SCL_TMO_SCL_TIMEOUT_Pos) 

/**
  * @brief I2C_SDA_TMO Register Bit Definition
  */
#define  I2C_SDA_TMO_SDA_TIMEOUT_Pos              (0)
#define  I2C_SDA_TMO_SDA_TIMEOUT_Msk              (0xFFFFFFFFU << I2C_SDA_TMO_SDA_TIMEOUT_Pos)      /*!<Configure the duration of SDA low timeout whose unit is APB clock period*/
#define  I2C_SDA_TMO_SDA_TIMEOUT                  I2C_SDA_TMO_SDA_TIMEOUT_Msk
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit0             (0x00000001U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit1             (0x00000002U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit2             (0x00000004U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit3             (0x00000008U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit4             (0x00000010U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit5             (0x00000020U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit6             (0x00000040U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit7             (0x00000080U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit8             (0x00000100U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit9             (0x00000200U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit10            (0x00000400U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit11            (0x00000800U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit12            (0x00001000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit13            (0x00002000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit14            (0x00004000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit15            (0x00008000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit16            (0x00010000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit17            (0x00020000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit18            (0x00040000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit19            (0x00080000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit20            (0x00100000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit21            (0x00200000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit22            (0x00400000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit23            (0x00800000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit24            (0x01000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit25            (0x02000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit26            (0x04000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit27            (0x08000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit28            (0x10000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit29            (0x20000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit30            (0x40000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 
#define  I2C_SDA_TMO_SDA_TIMEOUT_Bit31            (0x80000000U << I2C_SDA_TMO_SDA_TIMEOUT_Pos) 

/**
  * @brief I2C_SCL_STUCK Register Bit Definition
  */
#define  I2C_SCL_STUCK_SCL_STUCK_Pos              (0)
#define  I2C_SCL_STUCK_SCL_STUCK_Msk              (0x1U << I2C_SCL_STUCK_SCL_STUCK_Pos)             /*!<Read this register and clear SCL_STUCK interrupt (RAWISR[14])*/
#define  I2C_SCL_STUCK_SCL_STUCK                  I2C_SCL_STUCK_SCL_STUCK_Msk

/**
  * @brief I2C_SMB_SEXT Register Bit Definition
  */
#define  I2C_SMB_SEXT_SMB_SEXT_Pos                (0)
#define  I2C_SMB_SEXT_SMB_SEXT_Msk                (0xFFFFFFFFU << I2C_SMB_SEXT_SMB_SEXT_Pos)        /*!<Configure the slave device clock extension timeout (tLOW:SEXT) whose unit is APB clock period*/
#define  I2C_SMB_SEXT_SMB_SEXT                    I2C_SMB_SEXT_SMB_SEXT_Msk
#define  I2C_SMB_SEXT_SMB_SEXT_Bit0               (0x00000001U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit1               (0x00000002U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit2               (0x00000004U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit3               (0x00000008U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit4               (0x00000010U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit5               (0x00000020U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit6               (0x00000040U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit7               (0x00000080U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit8               (0x00000100U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit9               (0x00000200U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit10              (0x00000400U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit11              (0x00000800U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit12              (0x00001000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit13              (0x00002000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit14              (0x00004000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit15              (0x00008000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit16              (0x00010000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit17              (0x00020000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit18              (0x00040000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit19              (0x00080000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit20              (0x00100000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit21              (0x00200000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit22              (0x00400000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit23              (0x00800000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit24              (0x01000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit25              (0x02000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit26              (0x04000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit27              (0x08000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit28              (0x10000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit29              (0x20000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit30              (0x40000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 
#define  I2C_SMB_SEXT_SMB_SEXT_Bit31              (0x80000000U << I2C_SMB_SEXT_SMB_SEXT_Pos) 

/**
  * @brief I2C_SMB_MEXT Register Bit Definition
  */
#define  I2C_SMB_MEXT_SMB_MEXT_Pos                (0)
#define  I2C_SMB_MEXT_SMB_MEXT_Msk                (0xFFFFFFFFU << I2C_SMB_MEXT_SMB_MEXT_Pos)        /*!<Configure the clock extension timeout (tLOW:MEXT) for master device to transmit a byte. The unit is APB clock period*/
#define  I2C_SMB_MEXT_SMB_MEXT                    I2C_SMB_MEXT_SMB_MEXT_Msk
#define  I2C_SMB_MEXT_SMB_MEXT_Bit0               (0x00000001U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit1               (0x00000002U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit2               (0x00000004U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit3               (0x00000008U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit4               (0x00000010U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit5               (0x00000020U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit6               (0x00000040U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit7               (0x00000080U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit8               (0x00000100U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit9               (0x00000200U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit10              (0x00000400U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit11              (0x00000800U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit12              (0x00001000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit13              (0x00002000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit14              (0x00004000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit15              (0x00008000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit16              (0x00010000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit17              (0x00020000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit18              (0x00040000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit19              (0x00080000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit20              (0x00100000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit21              (0x00200000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit22              (0x00400000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit23              (0x00800000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit24              (0x01000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit25              (0x02000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit26              (0x04000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit27              (0x08000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit28              (0x10000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit29              (0x20000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit30              (0x40000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 
#define  I2C_SMB_MEXT_SMB_MEXT_Bit31              (0x80000000U << I2C_SMB_MEXT_SMB_MEXT_Pos) 

/**
  * @brief I2C_SMB_IDLE Register Bit Definition
  */
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Pos            (0)
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Msk            (0xFFFFU << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos)        /*!<Configure the required bus idle time and the unit is APB clock period*/
#define  I2C_SMB_IDLE_SMB_IDLE_CNT                I2C_SMB_IDLE_SMB_IDLE_CNT_Msk
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit0           (0x0001U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit1           (0x0002U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit2           (0x0004U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit3           (0x0008U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit4           (0x0010U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit5           (0x0020U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit6           (0x0040U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit7           (0x0080U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit8           (0x0100U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit9           (0x0200U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit10          (0x0400U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit11          (0x0800U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit12          (0x1000U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit13          (0x2000U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit14          (0x4000U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 
#define  I2C_SMB_IDLE_SMB_IDLE_CNT_Bit15          (0x8000U << I2C_SMB_IDLE_SMB_IDLE_CNT_Pos) 

/**
  * @brief I2C_SMB_ISR Register Bit Definition
  */
#define  I2C_SMB_ISR_R_SLV_TMO_Pos                (0)
#define  I2C_SMB_ISR_R_SLV_TMO_Msk                (0x1U << I2C_SMB_ISR_R_SLV_TMO_Pos)               /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_SLV_TMO                    I2C_SMB_ISR_R_SLV_TMO_Msk
#define  I2C_SMB_ISR_R_MST_TMO_Pos                (1)
#define  I2C_SMB_ISR_R_MST_TMO_Msk                (0x1U << I2C_SMB_ISR_R_MST_TMO_Pos)               /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_MST_TMO                    I2C_SMB_ISR_R_MST_TMO_Msk
#define  I2C_SMB_ISR_R_ARP_QUICK_Pos              (2)
#define  I2C_SMB_ISR_R_ARP_QUICK_Msk              (0x1U << I2C_SMB_ISR_R_ARP_QUICK_Pos)             /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_QUICK                  I2C_SMB_ISR_R_ARP_QUICK_Msk
#define  I2C_SMB_ISR_R_ARP_NOTIFY_Pos             (3)
#define  I2C_SMB_ISR_R_ARP_NOTIFY_Msk             (0x1U << I2C_SMB_ISR_R_ARP_NOTIFY_Pos)            /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_NOTIFY                 I2C_SMB_ISR_R_ARP_NOTIFY_Msk
#define  I2C_SMB_ISR_R_ARP_PRE_Pos                (4)
#define  I2C_SMB_ISR_R_ARP_PRE_Msk                (0x1U << I2C_SMB_ISR_R_ARP_PRE_Pos)               /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_PRE                    I2C_SMB_ISR_R_ARP_PRE_Msk
#define  I2C_SMB_ISR_R_ARP_RST_Pos                (5)
#define  I2C_SMB_ISR_R_ARP_RST_Msk                (0x1U << I2C_SMB_ISR_R_ARP_RST_Pos)               /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_RST                    I2C_SMB_ISR_R_ARP_RST_Msk
#define  I2C_SMB_ISR_R_ARP_UDID_Pos               (6)
#define  I2C_SMB_ISR_R_ARP_UDID_Msk               (0x1U << I2C_SMB_ISR_R_ARP_UDID_Pos)              /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_UDID                   I2C_SMB_ISR_R_ARP_UDID_Msk
#define  I2C_SMB_ISR_R_ARP_ASSGN_Pos              (7)
#define  I2C_SMB_ISR_R_ARP_ASSGN_Msk              (0x1U << I2C_SMB_ISR_R_ARP_ASSGN_Pos)             /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_ARP_ASSGN                  I2C_SMB_ISR_R_ARP_ASSGN_Msk
#define  I2C_SMB_ISR_R_PEC_NACK_Pos               (8)
#define  I2C_SMB_ISR_R_PEC_NACK_Msk               (0x1U << I2C_SMB_ISR_R_PEC_NACK_Pos)              /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_PEC_NACK                   I2C_SMB_ISR_R_PEC_NACK_Msk
#define  I2C_SMB_ISR_R_SMB_ALT_Pos                (10)
#define  I2C_SMB_ISR_R_SMB_ALT_Msk                (0x1U << I2C_SMB_ISR_R_SMB_ALT_Pos)               /*!<Refer to I2C_SMB_RAWISR register for more details*/
#define  I2C_SMB_ISR_R_SMB_ALT                    I2C_SMB_ISR_R_SMB_ALT_Msk

/**
  * @brief I2C_SMB_IMR Register Bit Definition
  */
#define  I2C_SMB_IMR_M_SLV_TMO_Pos                (0)
#define  I2C_SMB_IMR_M_SLV_TMO_Msk                (0x1U << I2C_SMB_IMR_M_SLV_TMO_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_SLV_TMO                    I2C_SMB_IMR_M_SLV_TMO_Msk
#define  I2C_SMB_IMR_M_MST_TMO_Pos                (1)
#define  I2C_SMB_IMR_M_MST_TMO_Msk                (0x1U << I2C_SMB_IMR_M_MST_TMO_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_MST_TMO                    I2C_SMB_IMR_M_MST_TMO_Msk
#define  I2C_SMB_IMR_M_ARP_QUICK_Pos              (2)
#define  I2C_SMB_IMR_M_ARP_QUICK_Msk              (0x1U << I2C_SMB_IMR_M_ARP_QUICK_Pos)             /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_QUICK                  I2C_SMB_IMR_M_ARP_QUICK_Msk
#define  I2C_SMB_IMR_M_ARP_NOTIFY_Pos             (3)
#define  I2C_SMB_IMR_M_ARP_NOTIFY_Msk             (0x1U << I2C_SMB_IMR_M_ARP_NOTIFY_Pos)            /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_NOTIFY                 I2C_SMB_IMR_M_ARP_NOTIFY_Msk
#define  I2C_SMB_IMR_M_ARP_PRE_Pos                (4)
#define  I2C_SMB_IMR_M_ARP_PRE_Msk                (0x1U << I2C_SMB_IMR_M_ARP_PRE_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_PRE                    I2C_SMB_IMR_M_ARP_PRE_Msk
#define  I2C_SMB_IMR_M_ARP_RST_Pos                (5)
#define  I2C_SMB_IMR_M_ARP_RST_Msk                (0x1U << I2C_SMB_IMR_M_ARP_RST_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_RST                    I2C_SMB_IMR_M_ARP_RST_Msk
#define  I2C_SMB_IMR_M_ARP_UDID_Pos               (6)
#define  I2C_SMB_IMR_M_ARP_UDID_Msk               (0x1U << I2C_SMB_IMR_M_ARP_UDID_Pos)              /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_UDID                   I2C_SMB_IMR_M_ARP_UDID_Msk
#define  I2C_SMB_IMR_M_ARP_ASSGN_Pos              (7)
#define  I2C_SMB_IMR_M_ARP_ASSGN_Msk              (0x1U << I2C_SMB_IMR_M_ARP_ASSGN_Pos)             /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_ARP_ASSGN                  I2C_SMB_IMR_M_ARP_ASSGN_Msk
#define  I2C_SMB_IMR_M_PEC_NACK_Pos               (8)
#define  I2C_SMB_IMR_M_PEC_NACK_Msk               (0x1U << I2C_SMB_IMR_M_PEC_NACK_Pos)              /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_PEC_NACK                   I2C_SMB_IMR_M_PEC_NACK_Msk
#define  I2C_SMB_IMR_M_SMB_ALT_Pos                (10)
#define  I2C_SMB_IMR_M_SMB_ALT_Msk                (0x1U << I2C_SMB_IMR_M_SMB_ALT_Pos)               /*!<Mask the interrupt status bit corresponding to I2C_SMB_ISR register*/
#define  I2C_SMB_IMR_M_SMB_ALT                    I2C_SMB_IMR_M_SMB_ALT_Msk

