SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_i2c.h
/**
  * @brief I2C_SMB_RAWISR Register Bit Definition
  */
#define  I2C_SMB_RAWISR_SLV_TMO_Pos               (0)
#define  I2C_SMB_RAWISR_SLV_TMO_Msk               (0x1U << I2C_SMB_RAWISR_SLV_TMO_Pos)              /*!<This bit is set when the clock for the slave device to communicate for one time extends timeout (START to STOP)*/
#define  I2C_SMB_RAWISR_SLV_TMO                   I2C_SMB_RAWISR_SLV_TMO_Msk
#define  I2C_SMB_RAWISR_MST_TMO_Pos               (1)
#define  I2C_SMB_RAWISR_MST_TMO_Msk               (0x1U << I2C_SMB_RAWISR_MST_TMO_Pos)              /*!<This bit is set when the master device transmits the clock extension timeout of a byte (START to ACK, ACK to ACK, ACK to STOP)*/
#define  I2C_SMB_RAWISR_MST_TMO                   I2C_SMB_RAWISR_MST_TMO_Msk
#define  I2C_SMB_RAWISR_ARP_QUICK_Pos             (2)
#define  I2C_SMB_RAWISR_ARP_QUICK_Msk             (0x1U << I2C_SMB_RAWISR_ARP_QUICK_Pos)            /*!<Set when the Quick command is received*/
#define  I2C_SMB_RAWISR_ARP_QUICK                 I2C_SMB_RAWISR_ARP_QUICK_Msk
#define  I2C_SMB_RAWISR_ARP_NOTIFY_Pos            (3)
#define  I2C_SMB_RAWISR_ARP_NOTIFY_Msk            (0x1U << I2C_SMB_RAWISR_ARP_NOTIFY_Pos)           /*!<Set when the Host Notify command is received*/
#define  I2C_SMB_RAWISR_ARP_NOTIFY                I2C_SMB_RAWISR_ARP_NOTIFY_Msk
#define  I2C_SMB_RAWISR_ARP_PRE_Pos               (4)
#define  I2C_SMB_RAWISR_ARP_PRE_Msk               (0x1U << I2C_SMB_RAWISR_ARP_PRE_Pos)              /*!<Set when the Prepare to ARP command is received*/
#define  I2C_SMB_RAWISR_ARP_PRE                   I2C_SMB_RAWISR_ARP_PRE_Msk
#define  I2C_SMB_RAWISR_ARP_RST_Pos               (5)
#define  I2C_SMB_RAWISR_ARP_RST_Msk               (0x1U << I2C_SMB_RAWISR_ARP_RST_Pos)              /*!<Set when the Reset ARP command is received*/
#define  I2C_SMB_RAWISR_ARP_RST                   I2C_SMB_RAWISR_ARP_RST_Msk
#define  I2C_SMB_RAWISR_ARP_UDID_Pos              (6)
#define  I2C_SMB_RAWISR_ARP_UDID_Msk              (0x1U << I2C_SMB_RAWISR_ARP_UDID_Pos)             /*!<Set when the Get UDID ARP command is received*/
#define  I2C_SMB_RAWISR_ARP_UDID                  I2C_SMB_RAWISR_ARP_UDID_Msk
#define  I2C_SMB_RAWISR_ARP_ASSGN_Pos             (7)
#define  I2C_SMB_RAWISR_ARP_ASSGN_Msk             (0x1U << I2C_SMB_RAWISR_ARP_ASSGN_Pos)            /*!<Set when the Assign Address ARP command is received*/
#define  I2C_SMB_RAWISR_ARP_ASSGN                 I2C_SMB_RAWISR_ARP_ASSGN_Msk
#define  I2C_SMB_RAWISR_PEC_NACK_Pos              (8)
#define  I2C_SMB_RAWISR_PEC_NACK_Msk              (0x1U << I2C_SMB_RAWISR_PEC_NACK_Pos)             /*!<Set when the slave device does not respond to the PEC byte of the ARP command*/
#define  I2C_SMB_RAWISR_PEC_NACK                  I2C_SMB_RAWISR_PEC_NACK_Msk
#define  I2C_SMB_RAWISR_SMB_ALT_Pos               (10)
#define  I2C_SMB_RAWISR_SMB_ALT_Msk               (0x1U << I2C_SMB_RAWISR_SMB_ALT_Pos)              /*!<Set when the slave device alarm is detected (SMBA is low)*/
#define  I2C_SMB_RAWISR_SMB_ALT                   I2C_SMB_RAWISR_SMB_ALT_Msk

/**
  * @brief I2C_SMB_ICR Register Bit Definition
  */
#define  I2C_SMB_ICR_CLR_SLV_TMO_Pos              (0)
#define  I2C_SMB_ICR_CLR_SLV_TMO_Msk              (0x1U << I2C_SMB_ICR_CLR_SLV_TMO_Pos)             /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_SLV_TMO                  I2C_SMB_ICR_CLR_SLV_TMO_Msk
#define  I2C_SMB_ICR_CLR_MST_TMO_Pos              (1)
#define  I2C_SMB_ICR_CLR_MST_TMO_Msk              (0x1U << I2C_SMB_ICR_CLR_MST_TMO_Pos)             /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_MST_TMO                  I2C_SMB_ICR_CLR_MST_TMO_Msk
#define  I2C_SMB_ICR_CLR_ARP_QUICK_Pos            (2)
#define  I2C_SMB_ICR_CLR_ARP_QUICK_Msk            (0x1U << I2C_SMB_ICR_CLR_ARP_QUICK_Pos)           /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_QUICK                I2C_SMB_ICR_CLR_ARP_QUICK_Msk
#define  I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos           (3)
#define  I2C_SMB_ICR_CLR_ARP_NOTIFY_Msk           (0x1U << I2C_SMB_ICR_CLR_ARP_NOTIFY_Pos)          /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_NOTIFY               I2C_SMB_ICR_CLR_ARP_NOTIFY_Msk
#define  I2C_SMB_ICR_CLR_ARP_PRE_Pos              (4)
#define  I2C_SMB_ICR_CLR_ARP_PRE_Msk              (0x1U << I2C_SMB_ICR_CLR_ARP_PRE_Pos)             /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_PRE                  I2C_SMB_ICR_CLR_ARP_PRE_Msk
#define  I2C_SMB_ICR_CLR_ARP_RST_Pos              (5)
#define  I2C_SMB_ICR_CLR_ARP_RST_Msk              (0x1U << I2C_SMB_ICR_CLR_ARP_RST_Pos)             /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_RST                  I2C_SMB_ICR_CLR_ARP_RST_Msk
#define  I2C_SMB_ICR_CLR_ARP_UDID_Pos             (6)
#define  I2C_SMB_ICR_CLR_ARP_UDID_Msk             (0x1U << I2C_SMB_ICR_CLR_ARP_UDID_Pos)            /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_UDID                 I2C_SMB_ICR_CLR_ARP_UDID_Msk
#define  I2C_SMB_ICR_CLR_ARP_ASSGN_Pos            (7)
#define  I2C_SMB_ICR_CLR_ARP_ASSGN_Msk            (0x1U << I2C_SMB_ICR_CLR_ARP_ASSGN_Pos)           /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_ARP_ASSGN                I2C_SMB_ICR_CLR_ARP_ASSGN_Msk
#define  I2C_SMB_ICR_CLR_PEC_NACK_Pos             (8)
#define  I2C_SMB_ICR_CLR_PEC_NACK_Msk             (0x1U << I2C_SMB_ICR_CLR_PEC_NACK_Pos)            /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_PEC_NACK                 I2C_SMB_ICR_CLR_PEC_NACK_Msk
#define  I2C_SMB_ICR_CLR_SMB_ALT_Pos              (10)
#define  I2C_SMB_ICR_CLR_SMB_ALT_Msk              (0x1U << I2C_SMB_ICR_CLR_SMB_ALT_Pos)             /*!<Write this bit to clear the interrupt corresponding to I2C_SMB_RAWISR*/
#define  I2C_SMB_ICR_CLR_SMB_ALT                  I2C_SMB_ICR_CLR_SMB_ALT_Msk

/**
  * @brief I2C_OPT_SAR Register Bit Definition
  */
#define  I2C_OPT_SAR_ADDR_Pos                     (0)
#define  I2C_OPT_SAR_ADDR_Msk                     (0x7FU << I2C_OPT_SAR_ADDR_Pos)                   /*!<The slave address of the I2C interface when working in SMBus slave mode*/
#define  I2C_OPT_SAR_ADDR                         I2C_OPT_SAR_ADDR_Msk
#define  I2C_OPT_SAR_ADDR_Bit0                    (0x01U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit1                    (0x02U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit2                    (0x04U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit3                    (0x08U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit4                    (0x10U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit5                    (0x20U << I2C_OPT_SAR_ADDR_Pos) 
#define  I2C_OPT_SAR_ADDR_Bit6                    (0x40U << I2C_OPT_SAR_ADDR_Pos) 

/**
  * @brief I2C_SMB_UDID_LSB Register Bit Definition
  */
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos        (0)
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Msk        (0xFFFFFFFFU << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) /*!<Configure SMBus UDID[31:0]*/
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB            I2C_SMB_UDID_LSB_SMB_UDID_LSB_Msk
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit0       (0x00000001U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit1       (0x00000002U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit2       (0x00000004U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit3       (0x00000008U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit4       (0x00000010U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit5       (0x00000020U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit6       (0x00000040U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit7       (0x00000080U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit8       (0x00000100U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit9       (0x00000200U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit10      (0x00000400U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit11      (0x00000800U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit12      (0x00001000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit13      (0x00002000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit14      (0x00004000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit15      (0x00008000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit16      (0x00010000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit17      (0x00020000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit18      (0x00040000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit19      (0x00080000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit20      (0x00100000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit21      (0x00200000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit22      (0x00400000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit23      (0x00800000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit24      (0x01000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit25      (0x02000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit26      (0x04000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit27      (0x08000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit28      (0x10000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit29      (0x20000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit30      (0x40000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 
#define  I2C_SMB_UDID_LSB_SMB_UDID_LSB_Bit31      (0x80000000U << I2C_SMB_UDID_LSB_SMB_UDID_LSB_Pos) 

/**
  * @brief I2C_SMB_UDID_MSB0 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos      (0)
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) /*!<Configure SMBus UDID[63:32]*/
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0          I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Msk
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit0     (0x00000001U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit1     (0x00000002U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit2     (0x00000004U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit3     (0x00000008U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit4     (0x00000010U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit5     (0x00000020U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit6     (0x00000040U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit7     (0x00000080U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit8     (0x00000100U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit9     (0x00000200U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit10    (0x00000400U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit11    (0x00000800U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit12    (0x00001000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit13    (0x00002000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit14    (0x00004000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit15    (0x00008000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit16    (0x00010000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit17    (0x00020000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit18    (0x00040000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit19    (0x00080000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit20    (0x00100000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit21    (0x00200000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit22    (0x00400000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit23    (0x00800000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit24    (0x01000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit25    (0x02000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit26    (0x04000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit27    (0x08000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit28    (0x10000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit29    (0x20000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit30    (0x40000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 
#define  I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Bit31    (0x80000000U << I2C_SMB_UDID_MSB0_SMB_UDID_MSB0_Pos) 

/**
  * @brief I2C_SMB_UDID_MSB1 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos      (0)
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) /*!<Configure SMBus UDID[95:64]*/
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1          I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Msk
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit0     (0x00000001U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit1     (0x00000002U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit2     (0x00000004U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit3     (0x00000008U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit4     (0x00000010U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit5     (0x00000020U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit6     (0x00000040U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit7     (0x00000080U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit8     (0x00000100U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit9     (0x00000200U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit10    (0x00000400U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit11    (0x00000800U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit12    (0x00001000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit13    (0x00002000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit14    (0x00004000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit15    (0x00008000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit16    (0x00010000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit17    (0x00020000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit18    (0x00040000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit19    (0x00080000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit20    (0x00100000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit21    (0x00200000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit22    (0x00400000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit23    (0x00800000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit24    (0x01000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit25    (0x02000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit26    (0x04000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit27    (0x08000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit28    (0x10000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit29    (0x20000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit30    (0x40000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 
#define  I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Bit31    (0x80000000U << I2C_SMB_UDID_MSB1_SMB_UDID_MSB1_Pos) 

/**
  * @brief I2C_SMB_UDID_MSB2 Register Bit Definition
  */
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos      (0)
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Msk      (0xFFFFFFFFU << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) /*!<Configure SMBus UDID[127:96]*/
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2          I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Msk
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit0     (0x00000001U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit1     (0x00000002U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit2     (0x00000004U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit3     (0x00000008U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit4     (0x00000010U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit5     (0x00000020U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit6     (0x00000040U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit7     (0x00000080U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit8     (0x00000100U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit9     (0x00000200U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit10    (0x00000400U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit11    (0x00000800U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit12    (0x00001000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit13    (0x00002000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit14    (0x00004000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit15    (0x00008000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit16    (0x00010000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit17    (0x00020000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit18    (0x00040000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit19    (0x00080000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit20    (0x00100000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit21    (0x00200000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit22    (0x00400000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit23    (0x00800000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit24    (0x01000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit25    (0x02000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit26    (0x04000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit27    (0x08000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit28    (0x10000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit29    (0x20000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit30    (0x40000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 
#define  I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Bit31    (0x80000000U << I2C_SMB_UDID_MSB2_SMB_UDID_MSB2_Pos) 

/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define  I2C_SLVMASK_MASK_Pos                     (0)
#define  I2C_SLVMASK_MASK_Msk                     (0x3FFU << I2C_SLVMASK_MASK_Pos)                  /*!<Slave address mask*/
#define  I2C_SLVMASK_MASK                         I2C_SLVMASK_MASK_Msk
#define  I2C_SLVMASK_MASK_Bit0                    (0x001U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit1                    (0x002U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit2                    (0x004U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit3                    (0x008U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit4                    (0x010U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit5                    (0x020U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit6                    (0x040U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit7                    (0x080U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit8                    (0x100U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_Bit9                    (0x200U << I2C_SLVMASK_MASK_Pos) 

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define  I2C_SLVRCVADDR_ADDR_Pos                  (0)
#define  I2C_SLVRCVADDR_ADDR_Msk                  (0x3FFU << I2C_SLVRCVADDR_ADDR_Pos)               /*!<Slave address actually received by I2C*/
#define  I2C_SLVRCVADDR_ADDR                      I2C_SLVRCVADDR_ADDR_Msk
#define  I2C_SLVRCVADDR_ADDR_Bit0                 (0x001U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit1                 (0x002U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit2                 (0x004U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit3                 (0x008U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit4                 (0x010U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit5                 (0x020U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit6                 (0x040U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit7                 (0x080U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit8                 (0x100U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_Bit9                 (0x200U << I2C_SLVRCVADDR_ADDR_Pos) 


#endif

